In [1]:
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
from sqlalchemy import create_engine

In [9]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root"
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [10]:
engine = create_engine(connection)

In [11]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [12]:
import pandas as pd

In [13]:
# Test to make sure that the database can be accessed
q = """SELECT * FROM actor;"""
pd.read_sql(q, engine)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-14 12:34:33
1           2       NICK      WAHLBERG 2006-02-14 12:34:33
2           3         ED         CHASE 2006-02-14 12:34:33
3           4   JENNIFER         DAVIS 2006-02-14 12:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-14 12:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-14 12:34:33
196       197      REESE          WEST 2006-02-14 12:34:33
197       198       MARY        KEITEL 2006-02-14 12:34:33
198       199      JULIA       FAWCETT 2006-02-14 12:34:33
199       200      THORA        TEMPLE 2006-02-14 12:34:33

[200 rows x 4 columns]

In [14]:
#1. What query would you run to get all the customers inside city_id = 312? 
# Your query should return the customers' first name, last name, email, address, and city.
q = """

SELECT customer.first_name, customer.last_name, customer.email, customer.address_id, city.city
FROM customer
JOIN address ON customer.address_id = address.address_id
JOIN city ON  address.city_id = city.city_id
WHERE city.city_id = 312;"""

pd.read_sql(q, engine)

  first_name last_name                              email  address_id    city
0     MATTIE   HOFFMAN  MATTIE.HOFFMAN@sakilacustomer.org         256  London
1      CECIL     VINES     CECIL.VINES@sakilacustomer.org         517  London